--####################################
--#   НАСТРОЙКИ ПРОЗРАЧНОСТИ ОКОН    #
--####################################

hl.config({
    decoration = {
        -- Значение 1.0 = непрозрачно, 0.0 = полностью прозрачно.
        -- Рекомендую начать с 0.85 для активного окна и 0.8 для неактивных.
        active_opacity = 1,
        inactive_opacity = 0.8,
        fullscreen_opacity = 1.0,  -- На полном экране прозрачность обычно не нужна

        shadow = {
            enabled = true,
            range = 4,
            render_power = 3,
            color = "rgba(1a1a1aee)",
        },

        --- Настройки размытия (blur) ---
        blur = {
            enabled = true,
            size = 3,              -- Радиус размытия (чем больше, тем сильнее эффект)
            passes = 1,            -- Качество (чем больше, тем плавнее, но тяжелее для GPU)
            ignore_opacity = true, -- Игнорировать прозрачность окна для слоя размытия (важно!)
            new_optimizations = true, -- Включает оптимизации производительности
            noise = 0.0117,        -- Небольшой шум для "матового" эффекта
            contrast = 0.9,        -- Контраст размытия
            brightness = 0.8,      -- Яркость размытия
            vibrancy = 0.17,       -- Насыщенность цветов размытия
        },
    },
})
